*** DONE Realistic multipliers
    CLOSED: [2020-12-15 Tue 10:46]
    - Get from the same method as alignment 8
    - But actually a bit different
    - There's a difference between alignment conditions
      - Depends on the cut off, though.
      - And also on valence, no?
    - Example
      - Target
        - Oil: 2200L per hour
      - Negative valence high alignment
        - 2000
        - Cutoff: 3000
      - Negative valence low alignment
        - 1400
        - Cutoff: 2100
    - So for negative high the cutoff is above both values
      - anecdote failed, so the target will fail
    - For negative low the cutoff is above anecdote, but below target
      - anecdote failed, but target not necessarily
    - For positive high, the cutoff should be below both of them
      - anecdote worked, so target will work
    - For positive low, the cutoff should be below anecdote, but above target
      - anecdote worked, but target not necessarily
    | valence  | similarity | multiplier_anecdote | multiplier_cutoff | target | anecdote | cutoff |
    |----------+------------+---------------------+-------------------+--------+----------+--------|
    | negative | low        |                 0.7 |               0.9 |   2200 |    1540. |  1980. |
    | negative | high       |                 1.4 |               1.6 |   2200 |    3080. |  3520. |
    | positive | low        |                 1.6 |               1.4 |   2200 |    3520. |  3080. |
    | positive | high       |                 0.9 |               0.7 |   2200 |    1980. |  1540. |
    #+TBLFM: $6=$5 * $3::$7=$5 * $4

    - Should negative high anecdote be higher or lower thatn the target?
      - Either way the cutoff is higher than both
      - Seems as though it should be below so that there's less reason
    - But also shouldn't there be two stages of multiplication, rather than two
    separate ones?
    - Making the cutoff and then anecdote from that
    - Or the other way around
    | valence  | similarity | multiplier_cutoff | multiplier_anecdote | target | cutoff | anecdote |
    |----------+------------+-------------------+---------------------+--------+--------+----------|
    | negative | low        |               0.5 |                 0.5 |   2200 |  1100. |     550. |
    | negative | high       |               1.5 |                 0.5 |   2200 |  3300. |    1650. |
    | positive | low        |               1.5 |                 1.5 |   2200 |  3300. |    4950. |
    | positive | high       |               0.5 |                 1.5 |   2200 |  1100. |    1650. |
    #+TBLFM: $6=$5 * $3::$7=$6 * $4
    - That doesn't work, because it doesn't guarantee the anecdote - target
    relationship in the high similarity conditions
    - Regardless, what we need is a list of five (for each within-subjects combination)
      - Each element has a list of two (for the anecdote/target
        - Each of those has five combinations (for each domain)
          - etc
    - Double check this
**** Test with already simulated data
     #+begin_src R
       library(drake)
       library(tidyverse)
       library(simr)

       loadd(data_simulation_alignment_8)

       formula <-
         allocation ~ alignment * reliability_amount * reliability_type * npv_amount + (1 | id)

       model <-
         formula %>%
         lmer(
           data = data_simulation_alignment_8
         )

       model %>%
         doTest(fcompare(~ alignment + reliability_amount))


       lm1 <- lmer(y ~ x + (x|g), data=simdata)
       lm0 <- lmer(y ~ x + (1|g), data=simdata)
       anova(lm1, lm0)
       compare(. ~ x + (1|g))(lm1)
       rcompare(~ (1|g))(lm1)
     #+end_src

     #+RESULTS:
     : 0.214325793064315

